{
    "07f260f4-466c-4607-9a33-f7273b24f1b4": {
        "_id": "07f260f4-466c-4607-9a33-f7273b24f1b4",
        "title": "Spicy Lemon-Ginger Chicken Soup",
        "imageUrl": "https://publish.purewow.net/wp-content/uploads/sites/2/2019/09/spicy-lemon-ginger-chicken-soup-recipe.jpg?resize=728%2C921",
        "description": "We love it for its simplicity, but it`s also totally customizable. “You can add turmeric root if you are looking for a super-deep color and anti-inflammatory properties,” she said. “I usually make the broth the day before and assemble the soup before eating—the flavors deepen as the broth sits. You can also add some rice or pasta for a richer version.",
        "servingTime": {
            "prep": "15",
            "cook": "30",
            "total": "45",
            "serves": "8"
        },
        "ingredients": "One 4-pound whole chicken, innards removed\n\n1 large yellow onion, peeled and chopped into large pieces\n\n2 medium carrots, chopped into large pieces\n\n2 celery stalks, chopped into large pieces\n\n1 large head garlic, cut crosswise\n\n½ to 1 jalapeño, cut lengthwise, plus more for garnish\n\nTwo 3-inch pieces ginger, peeled and chopped\n\n1 large bunch fresh parsley, plus more for garnish\n\n1 tablespoon coriander seeds\n\n1 tablespoon kosher salt\n\n2 teaspoons freshly ground black pepper\n\n6 ounces fresh spinach or other tender greens\n\n2 lemons, thinly sliced",
        "directions": "1. Combine the chicken, onion, carrot, celery, garlic, jalapeño, ginger, parsley, coriander, salt and black pepper in a large Dutch oven or saucepan. Add enough cold water to cover. Cover the pot and bring the liquid to a boil over high heat, then reduce the heat to low and simmer, skimming any impurities that might rise to the top of the liquid with a metal spoon. Cover and simmer until the chicken is tender and falls apart, 55 minutes to an hour. (Alternatively, you can cook the chicken and broth in a pressure cooker for 40 minutes.) 2. Transfer the chicken to a large plate and collect any broth that might drip down. Using a fine-mesh strainer, strain the stock into a clean saucepan and keep warm over low heat. Taste the stock and add salt if you feel it needs it. Shred the chicken using a fork. If you have more meat than you would like to serve, this is great to freeze for another use. 3. Divide the spinach, shredded chicken, jalapeño and lemon slices among serving bowls and top with the hot broth."
    },
    "07f260f4-466c-4607-9a33-f1173b24f1b4": {
        "_id": "07f260f4-466c-4607-9a33-f1173b24f1b4",
        "title": "Instant Pot Mushroom Wild Rice Soup",
        "imageUrl": "https://publish.purewow.net/wp-content/uploads/sites/2/2022/10/slow-cooker-mushroom-and-wild-rice-soup-recipe.jpg?resize=755%2C955",
        "description": "Welcome to soup season, where the bowls are overflowing and the spoons are plentiful. As it turns out, you don’t have to resort to that fast-casual joint you hate to love (What? The soups are good!) or spend hours simmering to achieve dinnertime bliss. With an Instant Pot in tow, it takes less than an hour to put together this creamy, comforting (and never gloppy) mushroom wild rice soup. Use any type of `shroom you like, and because we know you`re wondering, the leftovers reheat beautifully",
        "servingTime": {
            "prep": "15",
            "cook": "35",
            "total": "50",
            "serves": "6"
        },
        "ingredients": "Extra-virgin olive oil\n\n1 pound mushrooms (such as Baby Bella, shiitake or a mix), cleaned and quartered\n\nKosher salt and freshly ground black pepper\n\n1 medium yellow onion, chopped\n\n2 celery stalks, chopped\n\n1 medium carrot, peeled and chopped\n\n1 tablespoon fresh thyme leaves\n\n½ tablespoon sherry vinegar\n\n1 quart low-sodium chicken stock (or vegetable stock)\n\n1 cup wild rice\n\n½ cup half and half\n\nChopped fresh parsley, to garnish",
        "directions": "1. Set the Instant Pot to Sauté on high. Add a few tablespoons of the olive oil and the mushrooms. Cook, stirring frequently, until the mushrooms release their water and begin to brown, 8 to 10 minutes. Add the onion and a generous pinch of salt; cook until the onion is soft and translucent, about 5 minutes. 2. Add the celery, carrot and thyme, and cook until aromatic and slightly soft, about 5 minutes. Stir in the vinegar, followed by the stock and rice. Add a generous pinch of salt and a few grinds of pepper. 3. Cover the Instant Pot and set to Pressure Cook or Steam on high for 12 minutes, then allow the steam to release naturally (Slow Release) for 10 minutes more. Remove the lid and check the rice for doneness; if it is too firm, return the lid and Pressure Cook on high for 3 minutes more, then Quick Release the steam. 4. Stir in the half and half. Taste and adjust the seasoning with salt and pepper as needed. Divide among bowls and top with the parsley before serving. Store leftovers in an airtight container in the refrigerator for up to 5 days."
    }
}